"""
МОДУЛЬ 3
Программа "Личный счет"
Описание работы программы:
Пользователь запускает программу у него на счету 0
Программа предлагает следующие варианты действий
1. пополнить счет
2. покупка
3. история покупок
4. выход

1. пополнение счета
при выборе этого пункта пользователю предлагается ввести сумму на сколько пополнить счет
после того как пользователь вводит сумму она добавляется к счету
снова попадаем в основное меню

2. покупка
при выборе этого пункта пользователю предлагается ввести сумму покупки
если она больше количества денег на счете, то сообщаем что денег не хватает и переходим в основное меню
если денег достаточно предлагаем пользователю ввести название покупки, например (еда)
снимаем деньги со счета
сохраняем покупку в историю
выходим в основное меню

3. история покупок
выводим историю покупок пользователя (название и сумму)
возвращаемся в основное меню

4. выход
выход из программы

При выполнении задания можно пользоваться любыми средствами

Для реализации основного меню можно использовать пример ниже или написать свой
"""
import os

def use_functions():
    FILE_NAME_1 = 'sumBill.txt'
    FILE_NAME_2 = 'historyBill.txt'
    allSum=0
    historyBuy=[]

    if os.path.exists(FILE_NAME_1):
        with open(FILE_NAME_1, 'r') as f:
            allSum=int(f.read())
    if os.path.exists(FILE_NAME_2):
        with open(FILE_NAME_2, 'r') as f:
            historyBuy.append(f.read())


    while True:
        print('1. пополнение счета')
        print('2. покупка')
        print('3. история покупок')
        print('4. выход')

        choice = input('Выберите пункт меню ')
        if choice == '1':
            addSum=int(input("Введите сумму, на которую хотите пополнить Ваш счёт "))
            allSum+=addSum
        elif choice == '2':
            buySum=int(input("Введите сумму покупки "))
            if buySum>allSum:
                print('Для покупки не хватает средств на Вашем счёте')
            nameBuy=input('Введите название покупки (например: еда) ' )
            allSum-=buySum
            historyBuy.append(['nameBuy', buySum])

        elif choice == '3':
            print(historyBuy)
        elif choice == '4':
            with open(FILE_NAME_1, 'w') as f:
                f.write(f'{allSum}')
            with open(FILE_NAME_2, 'w') as f:
                f.write(f'{historyBuy}')
            break
        else:
            print('Неверный пункт меню')

use_functions()

